config/bzt-functional.yml
settings:
  artifacts-dir: artifacts/functional

execution:
  - executor: jmeter
    scenario: functional-tests
    concurrency: 1
    iterations: 1

scenarios:
  functional-tests:
    script: jmeter/ServeRest.jmx

modules:
  jmeter:
    path: "./apache-jmeter-5.6.3"
    detect-plugins: false
    csv-jtl-flags:
      time: true
      timestamp: true
      latency: true
      connectTime: true
      success: true
      label: true
      code: true
      message: true
      threadName: true
      saveAssertionResultsFailureMessage: true
      bytes: true
      threadCounts: true
      sentBytes: true

reporting:
  - module: console
  - module: final-stats